using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace TestFile
{
    class clDataBaseStatic
    {
        public clDataBaseStatic()
        {
            Init();

            foreach (Aglom aglom in aglomsArr)
            {
                var s = aglom;
            }

            RetC = 55;//%
            RetM = 400;
            RetTпла = 200;
            RetTпск = 74;
        }

        public double RetC{get; set; }
        public double RetM { get; set; }
        public double RetTпла { get; set; }
        public double RetTпск { get; set; }

        public static Aglom[] aglomsArr = new Aglom[10];
        public static Drob[] drobsArr = new Drob[10];
        public static Ekstrud[] ekstrudsArr = new Ekstrud[10];
        public static Konteiner[] konteinersArr = new Konteiner[10];
        public static Konveer[] konveersArr = new Konveer[10];
        public static Magnit[] magnitsArr = new Magnit[10];
        public static Peskosu[] peskosusArr = new Peskosu[10];

        private void Init()
        {
            aglomsArr[0] = new Aglom("АГМТ30", "570000", "agm90s.jpg", "100", "8", "1500", "30", "1800 х 950 х 1465", "200", "12", "400");
            aglomsArr[1] = new Aglom("АГМ-15", "300000", "agglomerator.jpg", "70", "9", "1500", "15", "1400х650х1250", "510", "4", "600");
            aglomsArr[2] = new Aglom("АГМ-75", "450000", "agm55.gif", "250", "5", "2000", "75", "2200х1000х1900", "820", "6", "1750");
            aglomsArr[3] = new Aglom("OULI-300", "645000", "ouli-200.jpg", "300", "5", "2000", "37", "2000 x 1000 x 1400", "300", "9", "1400");
            
            drobsArr[0] = new Drob("HSS200", "80000", "hss_a.jpg", "100", "5.5", "250х400", "20", "2", "795х770х1300", "500");
            drobsArr[1] = new Drob("HSS 230 A", "84368", "hss_a.jpg", "200", "4", "230x160", "6", "2", "1080x760x1200", "500");
            drobsArr[2] = new Drob("HSS 300 A", "84368", "hss_a.jpg", "300", "5.5", "300x210", "9", "2", "1310x930x1310", "540");
            drobsArr[3] = new Drob("HSS 400 A", "84368", "hss_a.jpg", "550", "7.5", "400x250", "12", "2", "1420x1070x1530", "550");
            
            ekstrudsArr[0] = new Ekstrud("SJSZ", "1900000", "shekkovuy_ekstruder_iz_kitaya.jpg", "500", "25",
                                         "от 100 до 400", "0.1", "37", "4200 х 680 х 1200");
            
            konteinersArr[0] = new Konteiner("КГ-12", "Тара (контейнер металлический) предназначен для хр...", "23873", "i-423211-01.jpg",
            "от -40С до +40С", "1000х1700х1000", "1200", "220", "3", "сварная", "ПФ-эмаль", "серый", "100");
            konteinersArr[1] = new Konteiner("КГ-01", "• Грузовой контейнер типа КГ предназначен для тран...", "5283", "kg01_a_big.jpg",
                "от +40С до -40С", "450x600x400", "500", "22", "3", "сварная", "ПФ-эмаль", "серый или синий", "40");
            konteinersArr[2] = new Konteiner("КГ-17", "• Металлический контейнер типа КГ предназначен для...", "13600", "kg17_big.jpg",
                "от +40С до -40С", "1050х1600х1000", "800", "106", "3", "сварная", "ПФ-эмаль", "серый или синий", "1300");
            konteinersArr[3] = new Konteiner("КС-03", "• Контейнер металлический типа КС предназначен для...", "6796", "ks03_big_2.jpg",
                "от +40С до -40С", "600х600х800", "1200", "33", "4", "сетчатый", "ПФ-эмаль", "серый или синий", "180");
            
            konveersArr[0] = new Konveer("КЛС4", "90000", "tr7_300.jpg", "400", "200", "0.2-2.2", "0-18", "Мотор-редуктор", "220-420", "220-420", "51-108");
            konveersArr[1] = new Konveer("КЛС5", "90000", "tr7_300.jpg", "500", "250", "0.2-2.5", "0-18", "Мотор-редуктор", "220-530", "220-530", "51-127");
            konveersArr[2] = new Konveer("КЛС6", "105000", "99e8b20e608b86227f56703b58bffb34.jpg", "650", "300", "0.2-2.5", "0-18", "Мотор-редуктор", "220-530", "220-530", "51-159");
            konveersArr[3] = new Konveer("КЛС8", "105000", "99e8b20e608b86227f56703b58bffb34.jpg", "800", "500", "0.25-2.5", "0-18", "Мотор-редуктор", "220-530", "220-530", "76-159");
            
            magnitsArr[0] = new Magnit("СМПА 500", "15000", "12ed41a4e08de10d7b6696134afb454a.png", "1115х1073х380", "500", "300", "450");
            magnitsArr[1] = new Magnit("СМПА 650 ", "15000", "Снимок.PNG", "1320х1073х380", "650", "350", "600");
            magnitsArr[2] = new Magnit("СМПА-ТМ 1200", "25000", "12ed41a4e08de10d7b6696134afb454a.png", "2185х1950х490", "1200", "450", "2700");
            magnitsArr[3] = new Magnit("СМПА-М 1600", "25000", "12ed41a4e08de10d7b6696134afb454a.png", "2521х1748х490", "1600", "450", "2150");
            
            peskosusArr[0] = new Peskosu("Р-03", "150000", "422.jpg", "300", "3", "1", "4", "9", "120", "40", "12", "50", "2475 х 950 х1465", "1000");
            peskosusArr[1] = new Peskosu("Р-07л", "119000", "2090109200.jpg", "250", "3.8", "1", "4", "9", "130", "45", "11", "40", "2475 х 950 х1465", "1000");
        }

        public struct Aglom
        {
            public string _имя,
                           _цена,
                           _фото,
                           _производительнсть,
                           _размергранул,
                           _чвротор,
                           _мощьность,
                           _габариты,
                           _загрпроем,
                           _ножи,
                           _масса;
            public Aglom(string имя, string цена, string фото, string производительность, string Размергранулы, string чвротор,
                string мощность, string габариты, string загрузпроем, string ножи, string масса)
            {
                _имя = имя;
                _цена = цена;
                _фото = фото;
                _производительнсть = производительность;
                _размергранул = Размергранулы;
                _чвротор = чвротор;
                _мощьность = мощность;
                _габариты = габариты;
                _загрпроем = загрузпроем;
                _ножи = ножи;
                _масса = масса;
            }

        }

        public struct Drob
        {
            public string _имя, _цена,_фото,_производительность,_мощность,_загрузпроем;
            public string _ротацнож,_стационнож,_габариты;
            public string _масса;
            public Drob(string имя, string цена, string фото, string производительность, string мощность, string загрузпроем, string ротацнож, string стационнож, string габариты, string масса)
            {
                _имя = имя;
                _цена = цена;
                _фото = фото;
                _производительность = производительность;
                _мощность = мощность;
                _загрузпроем = загрузпроем;
                _ротацнож = ротацнож;
                _стационнож = стационнож;
                _габариты = габариты;
                _масса = масса;
            }

        }

        public struct Ekstrud
        {
            public string _имя,
                           _цена,
                           _фото,
                           _производительность,
                           _скоростьшнека,
                           _регулиртемпература,
                           _погрешностьтемператур,
                           _мощность,
                           _габариты;
            public Ekstrud(string имя, string цена, string фото, string производительность,
                string скоростьшнека, string регулиртемпература, string погрешностьтемператур, string мощность, string габариты)
            {
                _имя = имя;
                _цена = цена;
                _фото = фото;
                _производительность = производительность;
                _скоростьшнека = скоростьшнека;
                _регулиртемпература = регулиртемпература;
                _погрешностьтемператур = погрешностьтемператур;
                _мощность = мощность;
                _габариты = габариты;
            }
        }

        public struct Konteiner
        {
            public string _имя,
                           _описание,
                           _цена,
                           _фото,
                           _температура,
                           _размеры,
                           _грузоподьемность,
                           _вес,
                           _толщина,
                           _конструкция,
                           _окраска,
                           _цвет,
                           _обьем;
            public Konteiner(string имя, string описание, string цена, string фото, string температура, string размеры,
                string грузоподьемность, string вес, string толщина, string конструкция, string окраска, string цвет, string обьем)
            {
                _имя = имя;
                _описание = описание;
                _цена = цена;
                _фото = фото;
                _температура = температура;
                _размеры = размеры;
                _грузоподьемность = грузоподьемность;
                _вес = вес;
                _толщина = толщина;
                _конструкция = конструкция;
                _окраска = окраска;
                _цвет = цвет;
                _обьем = обьем;
            }
        }

        public struct Konveer
        {
            public string _имя,
                           _цена,
                           _фото,
                           _ширина,
                           _длина,
                           _скорость,
                           _наклон,
                           _привод,
                           _дипривод,
                           _динатяжного,
                           _дироликов;

            public Konveer(string имя, string цена, string фото, string ширина,
                string длина, string скорость, string наклон, string привод, string дипривод, string динатяжного, string дироликов)
            {
                _имя = имя;
                _цена = цена;
                _фото = фото;
                _ширина = ширина;
                _длина = длина;
                _скорость = скорость;
                _наклон = наклон;
                _привод = привод;
                _дипривод = дипривод;
                _динатяжного = динатяжного;
                _дироликов = дироликов;
            }
        }

        public struct Magnit
        {
            public string _имя,
                           _цена,
                           _фото,
                           _габариты,
                           _ширина,
                           _глубина,
                           _масса;
            public Magnit(string имя, string цена, string фото, string габариты, string ширина, string глубина, string масса)
            {
                _имя = имя;
                _цена = цена;
                _фото = фото;
                _габариты = габариты;
                _ширина = ширина;
                _глубина = глубина;
                _масса = масса;
            }
        }

        public struct Peskosu
        {
            public string _имя,
                           _цена,
                           _фото,
                           _производительность,
                           _фракциявыход,
                           _влажностьвыход,
                           _чвротор,
                           _мощность,
                           _температуракамеры,
                           _времянагревакамеры,
                           _времясушки,
                           _загрузка,
                           _габариты,
                           _масса;
            public Peskosu(string имя, string цена, string фото, string производительность, string фракциявыход,
                string влажностьвыход, string чвротор, string мощность, string температуракамеры,
                string времянагревакамеры, string времясушки, string загрузка, string габариты, string масса)
            {
                _имя = имя;
                _цена = цена;
                _фото = фото;
                _производительность = производительность;
                _фракциявыход = фракциявыход;
                _влажностьвыход = влажностьвыход;
                _чвротор = чвротор;
                _мощность = мощность;
                _температуракамеры = температуракамеры;
                _времянагревакамеры = времянагревакамеры;
                _времясушки = времясушки;
                _загрузка = загрузка;
                _габариты = габариты;
                _масса = масса;
            }
        }

    }
}
