#include <iostream>
#include <stdio.h>

using namespace std;
//ЛПО-3Лаба_Мещеряков
int main()
{
   FILE *f=fopen("input.txt","r");
   int t,n,m,l=1, fl=0, z=0;
   char tabl[11][11]={
'0','f','M','T','D','=',':','*','u','c',';',
'f','0','<','=','0','<','0','0','<','0','>',
'M','0','0','0','0','>','0','0','<','<','>',
'T','0','0','0','0','0','0','0','<','0','>',
'D','0','0','0','0','0','0','0','<','<','>',
'=','0','0','0','0','0','0','0','0','=','>',
':','0','<','0','<','0','0','<','<','0','>',
'*','0','0','0','0','0','0','=','<','0','>',
'u','0','>','0','>','0','=','>','=','0','>',
'c','0','0','>','0','>','0','0','=','0','>',
';','>','>','>','>','>','>','>','>','>','='};
//'n','<','<','<','<','<','<','<','<','<','<','='};

   char pr[40],pr2[40], dop[20], ou[40];
   for(int i=0; i<41; i++)
   {
   fscanf(f,"%c",&pr[i]);
   }

   for(int i=0; i<41; i++)
   {
       if(pr[i]=='i' && pr[i+1]=='f')
       {
           pr[i]=pr[i+1];
           for(int j=i+1; j<40; j++)
           pr[j]=pr[j+1];
       }
        if (pr[i]=='T')
       for(int j=i+1, t=i+4 ; j<40; j++, t++)
       pr[j]=pr[t];
        if (pr[i]=='M')
       for(int j=i+1, t=i+3 ; j<40; j++, t++)
       pr[j]=pr[t];
        if (pr[i]=='D')
       for(int j=i+1, t=i+3 ; j<40; j++, t++)
       pr[j]=pr[t];
        if (pr[i]==':')
       for(int j=i+1, t=i+2 ; j<40; j++, t++)
       pr[j]=pr[t];
   }
   for(int i=0; i<32; i++)
   {
       pr2[i]=pr[i];
   }
    //преобразовываем массив самой программы, что бы найти индефикаторы и константы в таблице
    for (int i=0; i<31; i++)
    {if(pr[i]=='Z' || pr[i]=='X' || pr[i]=='i')
    pr[i]='u';
    else if(pr[i]=='0' ||pr[i]=='2')
    pr[i]='c';
    if(pr[i]=='\n')
    pr[i]=';';
        }

    //ищем координаты пересечения в таблице
    dop[0]='<';
    for(int k=0; k<29; k++)
    {
        for(int i=0; i<14; i++)
        {
            if(tabl[i][0]==pr[k])
            {
               n=i;
            }
            if(tabl[0][i]==pr[k+1])
            {
                m=i;
            }
        }
        dop[l]=tabl[n][m];
        if(dop[l]=='>')
        {
            if(dop[l-1]=='=')
               {
                   ou[z]=pr2[k-1];
                   ou[z+1]=pr2[k];
                   for(int q=k-1; q<31; q++, k++)
                    {
                        pr[q]=pr[k];
                        pr2[q]=pr2[k];
                    }
                    k=-1; l=0; z+=1;
               }

            else
            {
                ou[z]=pr2[k];
                for(int q=k; q<31; q++)
            {
                pr[q]=pr[q+1];
                pr2[q]=pr2[q+1];
            }
            k=-1; l=0; z++;
            }
        }
        l++;
    }

 /*  for( int i=0;i<28;i++) //это я уже просто искусственно вывела...удали в отчет когда бужешь ставлять
   if(ou[i]=='\n')
   for(int j=i; j<28; j++)
   ou[j]=ou[j+1];//вот по сюда надо удалять))
*/
    for (int i=0; i<28; i++)
    {
        if(ou[i]=='f')
        printf("if ");
        else if(ou[i]=='M')
        printf("MOD ");
        else if(ou[i]=='D')
        printf("DIV ");
        else if(ou[i]=='T')
        printf("THEN ");
        else if(ou[i]==':')
        printf(":= ");
        else
        printf("%c ", ou[i]);
    }


        return 0;
}
