#ifndef COMMON_H
#define COMMON_H
#include "common.h"

//--------------------------------------------------------
// проверяет нажата ли клавиша
//--------------------------------------------------------
BOOL IsKeyDown(int VK)
{
	return GetKeyState(VK) < 0;
}

//--------------------------------------------------------
// возвращает квадрат растояния между двумя точками
//--------------------------------------------------------
int Distance_square(int x1, int y1, int x2, int y2)
{
	int x = x1 - x2;
	int y = y1 - y2;
	return abs(x*x + y*y);
}

//--------------------------------------------------------
// конвертируем целое число в строку
//--------------------------------------------------------
char* IntToStr(int d)
{
	static char A[20]; // статический массив, существует до выхода из программы
	itoa(d, A, 10); // конвертируем число в текст
	return A; // возвращаем указатель на строку
}

#endif /* COMMON_H */ 