Insert into рег_даные
 (`№`, `Имя`, 		`Фамилия`, 	 `Отчество`, 	`Число`,  `Месяц`, `Год`,  `Пол`,  `Номер паспорта`, `Прописка`) values 
 ( 00, 'Петр', 		'Савцов',  	 'Павлович', 	 10,		 01,	1982, 	'М',   1736904250857090,'Санкт-Петербург'),
 ( 01, 'Сергей', 	'Ключников', 'Анатольевич',  23,		 12,	1980, 	'М',   4508179326964958,'Москва'),
 ( 02, 'Алексей',	'Лисенков',  'Иванович', 	 01,		 03,	1971, 	'М',   1043876251913704,'Смоленская обл., Смоленск'),
 ( 03, 'Маришка',	'Аркадьева', 'Николаевна', 	 17,		 03,	1974, 	'Ж',   3684015926077482,'Москва'),
 ( 04, 'Лёха', 		'Трифонов',  'Алексеевич', 	 30,		 10,	1963, 	'М',   5910372846991976,'Кемеровская обл., Новокузнецк'),
 ( 05, 'Татьяна',	'Ануфриева', 'Александровна',10,		 07,	1959, 	'Ж',   7253861940607126,'Ростовская обл., Волгодонск'),
 ( 06, 'Ирина', 	'Жалбэ',  	 'Мисбаховна', 	 11,		 08,	1960, 	'Ж',   6783491509243846,'Ростов-на-Дону'),
 ( 07, 'Леонид', 	'Васильков', 'Иванович', 	 29,		 11,	1977, 	'М',   0697824135348632,'Московская область, Внуково'),
 ( 08, 'Константин','Данила',  	 'Станиславович',21,		 12,	1972, 	'М',   1582340671996651,'Самара'),
 ( 09, 'Дмитрий', 	'Прохоров',  'Анатольевич',  05,		 01,	1963, 	'М',   6758012943952916,'Алтайский край, Барнаул'),
 ( 10, 'Екатерина', 'Ежова',  	 'Александровна',15,		 07,	1988, 	'Ж',   8075462135809268,'Пермский край, Пермь'),
 ( 11, 'Рустам', 	'Григорьев', 'Викторович', 	 31,		 03,	1990, 	'М',   4923087516358488,'Архангельская обл., Архангельск'),
 ( 12, 'Денис', 	'Червонцев', 'Викторович', 	 02,		 11,	1980, 	'М',   3217896509449666,'Ростовская обл., Новочеркасск'),
 ( 13, 'Владимир', 	'Тараканов', 'Борисович', 	 18,		 12,	1974, 	'М',   6819023547990169,'Москва'),
 ( 14, 'Софья', 	'Рогачева',  'Александровна',14,		 05,	1968, 	'Ж',   8470152369364140,'Красноярск'),
 ( 15, 'Вадим', 	'Каменский', 'Месропович', 	 02,		 09,	1961, 	'М',   6275038194843204,'Омская обл., Омск'),
 ( 16, 'Елена', 	'Бусыгина',  'Вазиховна', 	 10,		 02,	1970, 	'Ж',   2697513485108703,'Ивановская обл., Шуя'),
 ( 17, 'Денис', 	'Ведерников','Александрович',06,		 11,	1983, 	'М',   3769021450800937,'Московская область, Щелково'),
 ( 18, 'Станислав', 'Грушин',  	 'Николаевич', 	 12,		 07,	1975, 	'М',   8267049516315744,'Ленинградская область, Тосно'),
 ( 19, 'Наталья', 	'Бурцева',   'Владимировна', 18,		 07,	1979, 	'Ж',   8315749680209471,'Иркутская обл., Байкальск, Иркутск'),
 ( 20, 'Анна', 		'Тен',  	 'Александровна',11,		 04,	1989, 	'Ж',   4620851329359376,'Владимирская обл., Владимир'),
 ( 21, 'Владимир', 	'Попов',  	 'Алексеевич', 	 19,		 06,	1980, 	'М',   3420578691625560,'Казань'),
 ( 22, 'Наталья', 	'Рожкова',   'Александровна',01,		 10,	1973, 	'Ж',   1390472684518145,'Москва'),
 ( 23, 'Григорий', 	'Луканин',   'Александрович',28,		 01,	1969, 	'М',   5614920378496565,'Приморский край, Владивосток'),
 ( 24, 'Олег', 		'Шелковский','Геннадьевич',  13,		 08,	1966, 	'М',   1976438250792800,'Московская область, Дубна'),
 ( 25, 'Вероника', 	'Сергеева',  'Анатольевна',  17,		 12,	1982, 	'Ж',   0842571394956393,'Санкт-Петербург')
;Select * From рег_даные;

/*******************************************************************************/
Insert into справочная_информация(`№`,`Номер паспорта`,`Состояние`) values
(00, 6814888835, 'Active'),
(01, 6415878815, 'Active'),
(02, 2834583815, 'Active'),
(03, 6824685835, 'Dead'),
(04, 6014988055, 'Active'),
(05, 6834484335, 'Active'),
(06, 7812883890, 'No info'),
(07, 6724800844, 'Active'),
(08, 1914228836, 'Active')
;Select * From справочная_информация